//
//  Order.swift
//  LogisticExpress
//
//  Created by Дмитрий Соломаха on 01.04.2024.
//

import Foundation

// Структура модели заказа
struct OrderModel {
    var orderNumber: String
    var orderDate: String
    var deliveryAddress: String
    var storeName: String
    var totalWeight: Int
    var shopCoordinates: (Double, Double)
}

// Создаем класс или структуру для хранения данных о магазине
struct ShopData {
    let name: String
    let address: String
    let coordinates: (Double, Double)
}

let streetNamesKharkiv: [[String: Any]] = [
    ["Магазин": "Продуктовий двір","вул.": "Сумська", "буд.": "34", "координати": (50.003837, 36.229268)],
    ["Магазин": "ФрешМаркет","вул.": "Сумська", "буд.": "1", "координати": (50.003837, 36.229268)],
    ["Магазин": "Зелена крамниця","вул.": "Проспект Героїв Харкова", "буд.": "10", "координати": (49.997438, 36.232332)],
    ["Магазин": "Смачний вибір","вул.": "Пушкінська", "буд.": "5", "координати": (50.015255, 36.236731)],
    ["Магазин": "Рост","вул.": "Героїв Труда", "буд.": "22", "координати": (49.986516, 36.238269)],
    ["Магазин": "Поляна овочів","вул.": "Гагаріна", "буд.": "7", "координати": (49.996124, 36.252074)],
    ["Магазин": "Світ продуктів","вул.": "Спортивна", "буд.": "15", "координати": (50.011597, 36.255062)],
    ["Магазин": "Фуд Маркет","вул.": "Клочківська", "буд.": "30", "координати": (50.013954, 36.243371)],
    ["Магазин": "Овочевий рай","вул.": "Клари Цеткін", "буд.": "3", "координати": (50.023716, 36.240499)],
    ["Магазин": "Продуктовий кошик","вул.": "Проспект Героїв Харкова", "буд.": "45", "координати": (49.998736, 36.233887)],
    ["Магазин": "Крамниця смаку","вул.": "Південний бульвар", "буд.": "12", "координати": (50.003354, 36.217991)],
    ["Магазин": "Біофуд","вул.": "Академіка Павлова", "буд.": "18", "координати": (50.010144, 36.214246)],
    ["Магазин": "Продуктовий обрій","вул.": "Мироносицька", "буд.": "9", "координати": (50.009872, 36.227308)],
    ["Магазин": "Фруктовий обрій","вул.": "Харківський шлях", "буд.": "8", "координати": (50.018521, 36.218026)],
    ["Магазин": "Здорове харчування","вул.": "Блюхера", "буд.": "17", "координати": (50.017514, 36.229999)],
    ["Магазин": "Фруктовий рай","вул.": "Плехановська", "буд.": "6", "координати": (50.019201, 36.248698)],
    ["Магазин": "Органік Маркет","вул.": "Сумська", "буд.": "31", "координати": (50.005804, 36.228235)],
    ["Магазин": "Фуд Хаус","вул.": "Північна", "буд.": "20", "координати": (50.010044, 36.258013)],
    ["Магазин": "Продуктовий бульвар","вул.": "Героїв Сталінграда", "буд.": "25", "координати": (50.014178, 36.250636)],
    ["Магазин": "Турбота про смак","вул.": "Героїв Праці", "буд.": "2", "координати": (49.988334, 36.235983)],
    ["Магазин": "Магазин свіжих продуктів","вул.": "Героїв Праці", "буд.": "14", "координати": (49.985371, 36.229897)],
    ["Магазин": "Сімейний","вул.": "Проспект Героїв Харкова", "буд.": "37", "координати": (50.001425, 36.231121)],
    ["Магазин": "Природна крамниця","вул.": "Гоголя", "буд.": "4", "координати": (50.011863, 36.234898)],
    ["Магазин": "Казка","вул.": "Університетська", "буд.": "11", "координати": (50.020564, 36.231745)],
    ["Магазин": "Зелений ряд","вул.": "Тракторна", "буд.": "19", "координати": (50.013222, 36.209742)],
    ["Магазин": "Продуктова площа","вул.": "Пушкінська", "буд.": "23", "координати": (50.015715, 36.240903)],
    ["Магазин": "Фермерський ринок","вул.": "Клочківська", "буд.": "16", "координати": (50.019593, 36.245747)],
    ["Магазин": "Бутік продуктів","вул.": "Плехановська", "буд.": "33", "координати": (50.016975, 36.242310)],
    ["Магазин": "Смачна точка","вул.": "Проспект Героїв Харкова", "буд.": "28", "координати": (49.999273, 36.230083)],
    ["Магазин": "Продуктове коло","вул.": "Спортивна", "буд.": "13", "координати": (50.010730, 36.251488)],
    ["Магазин": "Овочевий світ","вул.": "Сумська", "буд.": "24", "координати": (50.006491, 36.230870)],
    ["Магазин": "Магазин свіжих овочів","вул.": "Гагаріна", "буд.": "29", "координати": (49.995217, 36.244670)],
    ["Магазин": "Крамниця фруктів","вул.": "Південний бульвар", "буд.": "36", "координати": (50.002843, 36.218882)],
    ["Магазин": "Продуктовий аромат","вул.": "Академіка Павлова", "буд.": "42", "координати": (50.008084, 36.212812)],
    ["Магазин": "Фуд Маркетплейс","вул.": "Героїв Труда", "буд.": "27", "координати": (49.987908, 36.238955)],
    ["Магазин": "Здоровий вибір","вул.": "Героїв Труда", "буд.": "38", "координати": (49.985102, 36.236501)],
    ["Магазин": "Продуктовий едем","вул.": "Клочковска", "буд.": "34", "координати": (50.016012, 36.241846)],
    ["Магазин": "Органічний ринок","вул.": "Проспект Героїв Харкова", "буд.": "50", "координати": (49.999631, 36.232491)],
    ["Магазин": "Фуд Центр","вул.": "Спортивна", "буд.": "21", "координати": (50.012553, 36.253476)],
    ["Магазин": "Продуктова галерея","вул.": "Сумська", "буд.": "40", "координати": (50.004603, 36.226813)],
    ["Магазин": "Крамниця домашніх продуктів","вул.": "Гагаріна", "буд.": "32", "координати": (49.994013, 36.248864)],
    ["Магазин": "Біо Магазин","вул.": "Південний бульвар", "буд.": "39", "координати": (50.002033, 36.221894)],
    ["Магазин": "Фуд Депо","вул.": "Академіка Павлова", "буд.": "46", "координати": (50.007402, 36.215967)],
    ["Магазин": "Продуктовий сад","вул.": "Героїв Праці", "буд.": "48", "координати": (49.984553, 36.238563)],
    ["Магазин": "Смаковий світ","вул.": "Героїв Праці", "буд.": "43", "координати": (49.987302, 36.233010)],
    ["Магазин": "Органічна крамниця","вул.": "Пушкінська", "буд.": "49", "координати": (50.015628, 36.239394)],
    ["Магазин": "Фуд Шоп","вул.": "Проспект Героїв Харкова", "буд.": "41", "координати": (50.001101, 36.232885)],
    ["Магазин": "Продуктовий куточок","вул.": "Спортивна", "буд.": "47", "координати": (50.014267, 36.251367)],
    ["Магазин": "Клас","вул.": "Сумська", "буд.": "44", "координати": (50.004997, 36.227440)],
    ["Магазин": "Сільпо","вул.": "Гагаріна", "буд.": "35", "координати": (49.996948, 36.249521)]
]
